/******************************************************************************
 *
 * Различные утилиты
 *
 *****************************************************************************/

import { NetInfo } from "react-native";

// Проверка соединения устройства с сетью
export const connected = () => {
    const connection = NetInfo.getConnectionInfo();
    if (connection.type === "none") {
        return false;
    } else {
        return true;
    }
};

/****************************************************
 *
 *   Я Вам тут свинью подложил...
 *
 *  .
 *                             _
 *     _._ _..._ .-',     _.._(`))
 *    '-. `     '  /-._.-'    ',/
 *       )         \            '.
 *      / _    _    |             \
 *     |  a    a    /              |
 *     \   .-.                     ;
 *      '-('' ).-'       ,'       ;
 *   хрю   '-;           |      .'
 *            \           \    /
 *            | 7  .__  _.-\   \
 *            | |  |  ``/  /`  /
 *           /,_|  |   /,_/   /
 *              /,_/      '`-'
 *
 ****************************************************/
